espressif/esp-idf/components/soc/esp32p4/include/soc/spi_mem_reg.h
#define SPI_MEM_SPI_SMEM_DOUT_HEX_MODE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x1AC)
/* SPI_MEM_SPI_SMEM_DOUTS_HEX_MODE : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUTS_HEX_MODE    (BIT(8))
#define SPI_MEM_SPI_SMEM_DOUTS_HEX_MODE_M  (BIT(8))
#define SPI_MEM_SPI_SMEM_DOUTS_HEX_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUTS_HEX_MODE_S  8
/* SPI_MEM_SPI_SMEM_DOUT15_MODE : R/W ;bitpos:[7] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT15_MODE    (BIT(7))
#define SPI_MEM_SPI_SMEM_DOUT15_MODE_M  (BIT(7))
#define SPI_MEM_SPI_SMEM_DOUT15_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT15_MODE_S  7
/* SPI_MEM_SPI_SMEM_DOUT14_MODE : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT14_MODE    (BIT(6))
#define SPI_MEM_SPI_SMEM_DOUT14_MODE_M  (BIT(6))
#define SPI_MEM_SPI_SMEM_DOUT14_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT14_MODE_S  6
/* SPI_MEM_SPI_SMEM_DOUT13_MODE : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT13_MODE    (BIT(5))
#define SPI_MEM_SPI_SMEM_DOUT13_MODE_M  (BIT(5))
#define SPI_MEM_SPI_SMEM_DOUT13_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT13_MODE_S  5
/* SPI_MEM_SPI_SMEM_DOUT12_MODE : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT12_MODE    (BIT(4))
#define SPI_MEM_SPI_SMEM_DOUT12_MODE_M  (BIT(4))
#define SPI_MEM_SPI_SMEM_DOUT12_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT12_MODE_S  4
/* SPI_MEM_SPI_SMEM_DOUT11_MODE : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT11_MODE    (BIT(3))
#define SPI_MEM_SPI_SMEM_DOUT11_MODE_M  (BIT(3))
#define SPI_MEM_SPI_SMEM_DOUT11_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT11_MODE_S  3
/* SPI_MEM_SPI_SMEM_DOUT10_MODE : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT10_MODE    (BIT(2))
#define SPI_MEM_SPI_SMEM_DOUT10_MODE_M  (BIT(2))
#define SPI_MEM_SPI_SMEM_DOUT10_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT10_MODE_S  2
/* SPI_MEM_SPI_SMEM_DOUT09_MODE : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT09_MODE    (BIT(1))
#define SPI_MEM_SPI_SMEM_DOUT09_MODE_M  (BIT(1))
#define SPI_MEM_SPI_SMEM_DOUT09_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT09_MODE_S  1
/* SPI_MEM_SPI_SMEM_DOUT08_MODE : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: the output signals are delayed by system clock cycles, 0: output without delayed
, 1: output with the posedge of clk_apb,2 output with the negedge of clk_apb, 3:
 output with the posedge of clk_160,4 output with the negedge of clk_160,5: outp
ut with the spi_clk high edge ,6: output with the spi_clk low edge.*/
#define SPI_MEM_SPI_SMEM_DOUT08_MODE    (BIT(0))
#define SPI_MEM_SPI_SMEM_DOUT08_MODE_M  (BIT(0))
#define SPI_MEM_SPI_SMEM_DOUT08_MODE_V  0x1
#define SPI_MEM_SPI_SMEM_DOUT08_MODE_S  0

#define SPI_MEM_CLOCK_GATE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x200)
/* SPI_MEM_SPI_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: Register clock gate enable signal. 1: Enable. 0: Disable..*/
#define SPI_MEM_SPI_CLK_EN    (BIT(0))
#define SPI_MEM_SPI_CLK_EN_M  (BIT(0))
#define SPI_MEM_SPI_CLK_EN_V  0x1
#define SPI_MEM_SPI_CLK_EN_S  0

#define SPI_MEM_XTS_PLAIN_BASE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x300)
/* SPI_MEM_SPI_XTS_PLAIN : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This field is only used to generate include file in c case. This field is useles
s. Please do not use this field..*/
#define SPI_MEM_SPI_XTS_PLAIN    0xFFFFFFFF
#define SPI_MEM_SPI_XTS_PLAIN_M  ((SPI_MEM_SPI_XTS_PLAIN_V)<<(SPI_MEM_SPI_XTS_PLAIN_S))
#define SPI_MEM_SPI_XTS_PLAIN_V  0xFFFFFFFF
#define SPI_MEM_SPI_XTS_PLAIN_S  0

#define SPI_MEM_XTS_LINESIZE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x340)
/* SPI_MEM_SPI_XTS_LINESIZE : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: This bits stores the line-size parameter which will be used in manual encryption
 calculation. It decides how many bytes will be encrypted one time. 0: 16-bytes,
 1: 32-bytes, 2: 64-bytes, 3:reserved..*/
#define SPI_MEM_SPI_XTS_LINESIZE    0x00000003
#define SPI_MEM_SPI_XTS_LINESIZE_M  ((SPI_MEM_SPI_XTS_LINESIZE_V)<<(SPI_MEM_SPI_XTS_LINESIZE_S))
#define SPI_MEM_SPI_XTS_LINESIZE_V  0x3
#define SPI_MEM_SPI_XTS_LINESIZE_S  0

