espressif/esp-idf/components/soc/esp32p4/include/soc/spi_mem_reg.h
#define SPI_MEM_XTS_DESTINATION_REG(i)          (REG_SPI_MEM_BASE(i) + 0x344)
/* SPI_MEM_SPI_XTS_DESTINATION : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: This bit stores the destination parameter which will be used in manual encryptio
n calculation. 0: flash(default), 1: psram(reserved). Only default value can be
used..*/
#define SPI_MEM_SPI_XTS_DESTINATION    (BIT(0))
#define SPI_MEM_SPI_XTS_DESTINATION_M  (BIT(0))
#define SPI_MEM_SPI_XTS_DESTINATION_V  0x1
#define SPI_MEM_SPI_XTS_DESTINATION_S  0

#define SPI_MEM_XTS_PHYSICAL_ADDRESS_REG(i)          (REG_SPI_MEM_BASE(i) + 0x348)
/* SPI_MEM_SPI_XTS_PHYSICAL_ADDRESS : R/W ;bitpos:[25:0] ;default: 26'h0 ; */
/*description: This bits stores the physical-address parameter which will be used in manual enc
ryption calculation. This value should aligned with byte number decided by line-
size parameter..*/
#define SPI_MEM_SPI_XTS_PHYSICAL_ADDRESS    0x03FFFFFF
#define SPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_M  ((SPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_V)<<(SPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_S))
#define SPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_V  0x3FFFFFF
#define SPI_MEM_SPI_XTS_PHYSICAL_ADDRESS_S  0

#define SPI_MEM_XTS_TRIGGER_REG(i)          (REG_SPI_MEM_BASE(i) + 0x34C)
/* SPI_MEM_SPI_XTS_TRIGGER : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to trigger the process of manual encryption calculation. This actio
n should only be asserted when manual encryption status is 0. After this action,
 manual encryption status becomes 1. After calculation is done, manual encryptio
n status becomes 2..*/
#define SPI_MEM_SPI_XTS_TRIGGER    (BIT(0))
#define SPI_MEM_SPI_XTS_TRIGGER_M  (BIT(0))
#define SPI_MEM_SPI_XTS_TRIGGER_V  0x1
#define SPI_MEM_SPI_XTS_TRIGGER_S  0

#define SPI_MEM_XTS_RELEASE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x350)
/* SPI_MEM_SPI_XTS_RELEASE : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to release encrypted result to mspi. This action should only be ass
erted when manual encryption status is 2. After this action, manual encryption s
tatus will become 3..*/
#define SPI_MEM_SPI_XTS_RELEASE    (BIT(0))
#define SPI_MEM_SPI_XTS_RELEASE_M  (BIT(0))
#define SPI_MEM_SPI_XTS_RELEASE_V  0x1
#define SPI_MEM_SPI_XTS_RELEASE_S  0

#define SPI_MEM_XTS_DESTROY_REG(i)          (REG_SPI_MEM_BASE(i) + 0x354)
/* SPI_MEM_SPI_XTS_DESTROY : WT ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to destroy encrypted result. This action should be asserted only wh
en manual encryption status is 3. After this action, manual encryption status wi
ll become 0..*/
#define SPI_MEM_SPI_XTS_DESTROY    (BIT(0))
#define SPI_MEM_SPI_XTS_DESTROY_M  (BIT(0))
#define SPI_MEM_SPI_XTS_DESTROY_V  0x1
#define SPI_MEM_SPI_XTS_DESTROY_S  0

#define SPI_MEM_XTS_STATE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x358)
/* SPI_MEM_SPI_XTS_STATE : RO ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: This bits stores the status of manual encryption. 0: idle, 1: busy of encryption
 calculation, 2: encryption calculation is done but the encrypted result is invi
sible to mspi, 3: the encrypted result is visible to mspi..*/
#define SPI_MEM_SPI_XTS_STATE    0x00000003
#define SPI_MEM_SPI_XTS_STATE_M  ((SPI_MEM_SPI_XTS_STATE_V)<<(SPI_MEM_SPI_XTS_STATE_S))
#define SPI_MEM_SPI_XTS_STATE_V  0x3
#define SPI_MEM_SPI_XTS_STATE_S  0

#define SPI_MEM_XTS_DATE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x35C)
/* SPI_MEM_SPI_XTS_DATE : R/W ;bitpos:[29:0] ;default: 30'h20201010 ; */
/*description: This bits stores the last modified-time of manual encryption feature..*/
#define SPI_MEM_SPI_XTS_DATE    0x3FFFFFFF
#define SPI_MEM_SPI_XTS_DATE_M  ((SPI_MEM_SPI_XTS_DATE_V)<<(SPI_MEM_SPI_XTS_DATE_S))
#define SPI_MEM_SPI_XTS_DATE_V  0x3FFFFFFF
#define SPI_MEM_SPI_XTS_DATE_S  0

#define SPI_MEM_MMU_ITEM_CONTENT_REG(i)          (REG_SPI_MEM_BASE(i) + 0x37C)
/* SPI_MEM_SPI_MMU_ITEM_CONTENT : R/W ;bitpos:[31:0] ;default: 32'h037c ; */
/*description: MSPI-MMU item content.*/
#define SPI_MEM_SPI_MMU_ITEM_CONTENT    0xFFFFFFFF
#define SPI_MEM_SPI_MMU_ITEM_CONTENT_M  ((SPI_MEM_SPI_MMU_ITEM_CONTENT_V)<<(SPI_MEM_SPI_MMU_ITEM_CONTENT_S))
#define SPI_MEM_SPI_MMU_ITEM_CONTENT_V  0xFFFFFFFF
#define SPI_MEM_SPI_MMU_ITEM_CONTENT_S  0

#define SPI_MEM_MMU_ITEM_INDEX_REG(i)          (REG_SPI_MEM_BASE(i) + 0x380)
/* SPI_MEM_SPI_MMU_ITEM_INDEX : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: MSPI-MMU item index.*/
#define SPI_MEM_SPI_MMU_ITEM_INDEX    0xFFFFFFFF
#define SPI_MEM_SPI_MMU_ITEM_INDEX_M  ((SPI_MEM_SPI_MMU_ITEM_INDEX_V)<<(SPI_MEM_SPI_MMU_ITEM_INDEX_S))
#define SPI_MEM_SPI_MMU_ITEM_INDEX_V  0xFFFFFFFF
#define SPI_MEM_SPI_MMU_ITEM_INDEX_S  0

#define SPI_MEM_MMU_POWER_CTRL_REG(i)          (REG_SPI_MEM_BASE(i) + 0x384)
/* SPI_MEM_RDN_RESULT : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: MSPI module clock domain and AXI clock domain ECO register result register.*/
#define SPI_MEM_RDN_RESULT    (BIT(31))
#define SPI_MEM_RDN_RESULT_M  (BIT(31))
#define SPI_MEM_RDN_RESULT_V  0x1
#define SPI_MEM_RDN_RESULT_S  31
/* SPI_MEM_RDN_ENA : HRO ;bitpos:[30] ;default: 1'b0 ; */
/*description: ECO register enable bit.*/
#define SPI_MEM_RDN_ENA    (BIT(30))
#define SPI_MEM_RDN_ENA_M  (BIT(30))
#define SPI_MEM_RDN_ENA_V  0x1
#define SPI_MEM_RDN_ENA_S  30
/* SPI_MEM_AUX_CTRL : HRO ;bitpos:[29:16] ;default: 14'h1320 ; */
/*description: MMU PSRAM aux control register.*/
#define SPI_MEM_AUX_CTRL    0x00003FFF
#define SPI_MEM_AUX_CTRL_M  ((SPI_MEM_AUX_CTRL_V)<<(SPI_MEM_AUX_CTRL_S))
#define SPI_MEM_AUX_CTRL_V  0x3FFF
#define SPI_MEM_AUX_CTRL_S  16
/* SPI_MEM_SPI_MMU_PAGE_SIZE : R/W ;bitpos:[4:3] ;default: 2'd0 ; */
/*description: 0: Max page size , 1: Max page size/2 , 2: Max page size/4, 3: Max page size/8.*/
#define SPI_MEM_SPI_MMU_PAGE_SIZE    0x00000003
#define SPI_MEM_SPI_MMU_PAGE_SIZE_M  ((SPI_MEM_SPI_MMU_PAGE_SIZE_V)<<(SPI_MEM_SPI_MMU_PAGE_SIZE_S))
#define SPI_MEM_SPI_MMU_PAGE_SIZE_V  0x3
#define SPI_MEM_SPI_MMU_PAGE_SIZE_S  3
/* SPI_MEM_SPI_MMU_MEM_FORCE_PU : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: Set this bit to force mmu-memory powerup, in this case, the power should also be
 controlled by rtc..*/
#define SPI_MEM_SPI_MMU_MEM_FORCE_PU    (BIT(2))
#define SPI_MEM_SPI_MMU_MEM_FORCE_PU_M  (BIT(2))
#define SPI_MEM_SPI_MMU_MEM_FORCE_PU_V  0x1
#define SPI_MEM_SPI_MMU_MEM_FORCE_PU_S  2
/* SPI_MEM_SPI_MMU_MEM_FORCE_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to force mmu-memory powerdown.*/
#define SPI_MEM_SPI_MMU_MEM_FORCE_PD    (BIT(1))
#define SPI_MEM_SPI_MMU_MEM_FORCE_PD_M  (BIT(1))
#define SPI_MEM_SPI_MMU_MEM_FORCE_PD_V  0x1
#define SPI_MEM_SPI_MMU_MEM_FORCE_PD_S  1
/* SPI_MEM_SPI_MMU_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to enable mmu-memory clock force on.*/
#define SPI_MEM_SPI_MMU_MEM_FORCE_ON    (BIT(0))
#define SPI_MEM_SPI_MMU_MEM_FORCE_ON_M  (BIT(0))
#define SPI_MEM_SPI_MMU_MEM_FORCE_ON_V  0x1
#define SPI_MEM_SPI_MMU_MEM_FORCE_ON_S  0

#define SPI_MEM_DPA_CTRL_REG(i)          (REG_SPI_MEM_BASE(i) + 0x388)
/* SPI_MEM_SPI_CRYPT_DPA_SELECT_REGISTER : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: 1: MSPI XTS DPA clock gate is controlled by SPI_CRYPT_CALC_D_DPA_EN and SPI_CRYP
T_SECURITY_LEVEL. 0: Controlled by efuse bits..*/
#define SPI_MEM_SPI_CRYPT_DPA_SELECT_REGISTER    (BIT(4))
#define SPI_MEM_SPI_CRYPT_DPA_SELECT_REGISTER_M  (BIT(4))
#define SPI_MEM_SPI_CRYPT_DPA_SELECT_REGISTER_V  0x1
#define SPI_MEM_SPI_CRYPT_DPA_SELECT_REGISTER_S  4
/* SPI_MEM_SPI_CRYPT_CALC_D_DPA_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: Only available when SPI_CRYPT_SECURITY_LEVEL is not 0. 1: Enable DPA in the calc
ulation that using key 1 or key 2. 0: Enable DPA only in the calculation that us
ing key 1..*/
#define SPI_MEM_SPI_CRYPT_CALC_D_DPA_EN    (BIT(3))
#define SPI_MEM_SPI_CRYPT_CALC_D_DPA_EN_M  (BIT(3))
#define SPI_MEM_SPI_CRYPT_CALC_D_DPA_EN_V  0x1
#define SPI_MEM_SPI_CRYPT_CALC_D_DPA_EN_S  3
/* SPI_MEM_SPI_CRYPT_SECURITY_LEVEL : R/W ;bitpos:[2:0] ;default: 3'd7 ; */
/*description: Set the security level of spi mem cryption. 0: Shut off cryption DPA funtion. 1-
7: The bigger the number is, the more secure the cryption is. (Note that the per
formance of cryption will decrease together with this number increasing).*/
#define SPI_MEM_SPI_CRYPT_SECURITY_LEVEL    0x00000007
#define SPI_MEM_SPI_CRYPT_SECURITY_LEVEL_M  ((SPI_MEM_SPI_CRYPT_SECURITY_LEVEL_V)<<(SPI_MEM_SPI_CRYPT_SECURITY_LEVEL_S))
#define SPI_MEM_SPI_CRYPT_SECURITY_LEVEL_V  0x7
#define SPI_MEM_SPI_CRYPT_SECURITY_LEVEL_S  0

#define SPI_MEM_REGISTERRND_ECO_HIGH_REG(i)          (REG_SPI_MEM_BASE(i) + 0x3F0)
/* SPI_MEM_REGISTERRND_ECO_HIGH : RO ;bitpos:[31:0] ;default: 32'h037c ; */
/*description: ECO high register.*/
#define SPI_MEM_REGISTERRND_ECO_HIGH    0xFFFFFFFF
#define SPI_MEM_REGISTERRND_ECO_HIGH_M  ((SPI_MEM_REGISTERRND_ECO_HIGH_V)<<(SPI_MEM_REGISTERRND_ECO_HIGH_S))
#define SPI_MEM_REGISTERRND_ECO_HIGH_V  0xFFFFFFFF
#define SPI_MEM_REGISTERRND_ECO_HIGH_S  0

#define SPI_MEM_REGISTERRND_ECO_LOW_REG(i)          (REG_SPI_MEM_BASE(i) + 0x3F4)
/* SPI_MEM_REGISTERRND_ECO_LOW : RO ;bitpos:[31:0] ;default: 32'h037c ; */
/*description: ECO low register.*/
#define SPI_MEM_REGISTERRND_ECO_LOW    0xFFFFFFFF
#define SPI_MEM_REGISTERRND_ECO_LOW_M  ((SPI_MEM_REGISTERRND_ECO_LOW_V)<<(SPI_MEM_REGISTERRND_ECO_LOW_S))
#define SPI_MEM_REGISTERRND_ECO_LOW_V  0xFFFFFFFF
#define SPI_MEM_REGISTERRND_ECO_LOW_S  0

#define SPI_MEM_DATE_REG(i)          (REG_SPI_MEM_BASE(i) + 0x3FC)
/* SPI_MEM_DATE : R/W ;bitpos:[27:0] ;default: 28'h2212091 ; */
/*description: SPI0 register version..*/
#define SPI_MEM_DATE    0x0FFFFFFF
#define SPI_MEM_DATE_M  ((SPI_MEM_DATE_V)<<(SPI_MEM_DATE_S))
#define SPI_MEM_DATE_V  0xFFFFFFF
#define SPI_MEM_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_SPI_MEM_REG_H_ */
